PartsVisibility Property
 The visibility setting for parts in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PartsVisibility PartsVisibility { get; set; }
Visual Basic
Public Property PartsVisibility As PartsVisibility
	Get
	Set
Visual C++
public:
property PartsVisibility PartsVisibility {
	PartsVisibility get ();
	void set (PartsVisibility value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →